docs/1c-export-mobile/MobileAgent/InformationRegisters/НовоеСообщение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>НовоеСообщение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Новое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокДіїЛіцензії</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБорг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВідділенняНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Власний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйСтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАсортимета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыАсортимета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъмЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанийВВайбере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактВайбер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтПоследнейПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПошуку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналиПошуку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Борг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновлення</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месенджер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМесендеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Асортимент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АсортиментПрезентацій</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоцМережі</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Посилання</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мережа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидиСоцМереж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПосиланняВБраузері</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/CommonModules/ViberОбновлениеСервер/Ext/Module.bsl
#Область Отправить_Запрос

Функция ОтправитьЗапросНаПолучениеИнформации(СтруктураЗапроса)
	
	СтрокаJSON = КодироватьСтроку(СтрокаJSON, СпособКодированияСтроки.КодировкаURL);
	
	URL = "ltex1c.com.ua/ltexbot/hs/bots/exchange";
	
	SSL =  Новый ЗащищенноеСоединениеOpenSSL; 
	ХТТПСоединение = Новый HTTPСоединение(СокрЛП(URL),,,,,, SSL);
		

		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса); 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", ТипКонтентаJSON());
	ХТТПЗапрос = Новый HTTPЗапрос("",Заголовки);
	ХТТПЗапрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
	ХТТПЗапрос.Заголовки = Заголовки;
	
	Ответ = ХТТПСоединение.ОтправитьДляОбработки(ХТТПЗапрос);
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния = 200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТекстОтвета);
		ДеревоОтвета =  ПрочитатьJSON(Чтение,Ложь);
		Возврат ДеревоОтвета;
	Иначе
		Сообщить("Ошибка: " + Ответ.КодСостояния);
		Возврат Ответ;
	КонецЕсли; 

	
КонецФункции

Функция ТипКонтентаJSON()
	
	 Возврат "application/json";
	
 КонецФункции
 
Функция СоздатьСтрокуBase64(Строка) Экспорт

 ВременныйФайл = ПолучитьИмяВременногоФайла();
 
 ЗаписьТекста = Новый ЗаписьТекста(ВременныйФайл, "CESU-8");
 ЗаписьТекста.Записать(Строка);
 ЗаписьТекста.Закрыть();
 
 ДД_Файла = Новый ДвоичныеДанные(ВременныйФайл);
 СтрокаBase64 = Base64Строка(ДД_Файла);
 
 УдалитьФайлы(ВременныйФайл);
 
 Возврат СтрокаBase64;

КонецФункции
#КонецОбласти

#Область Запросы_В_Базу

Функция ОбновитьСписокИсторииСообщений()Экспорт
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("method", "vibermobile");
	СтруктураЗапроса.Вставить("IDdesktop", Строка(Константы.ПарольВхода.Получить()));
	
	ПоследняяДатаОбновления = Константы.ДатаПоследнегоОбновленияВайбер.Получить();
	Если НЕ ЗначениеЗаполнено(ПоследняяДатаОбновления) Тогда
		ПоследняяДатаОбновления = "0";
	КонецЕсли;
	
	Дата = СтрЗаменить(Строка(ПоследняяДатаОбновления), ".", "");
	Дата = СтрЗаменить(Дата, " ", "");
	Дата = СтрЗаменить(Дата, ":", "");
	
	СтруктураЗапроса.Вставить("Дата", Дата);
	
	Ответ = ОтправитьЗапросНаПолучениеИнформации(СтруктураЗапроса); 
	
	Возврат Ответ; 

	
	
КонецФункции

Функция ОтправитьСообщение(СписокКонтактов, НовоеСообщение, СтруктуруФайла)Экспорт
	
	МассивИДКонтрагентов = Новый Массив;
	Для Каждого Стр из СписокКонтактов Цикл
		МассивИДКонтрагентов.Добавить(Строка(Стр.УникальныйИдентификатор()));
		Если ТипЗнч(Стр) = Тип("СправочникСсылка.Контрагенты") Тогда
			КонтактСсылка = Истина;
		Иначе
			КонтактСсылка = Ложь;
		КонецЕсли;	
	КонецЦикла;
		
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("method", "SendMessage");
	СтруктураЗапроса.Вставить("Контакты", МассивИДКонтрагентов);
	СтруктураЗапроса.Вставить("КонтрагентСсылка", КонтактСсылка);
	СтруктураЗапроса.Вставить("НовоеСообщение", НовоеСообщение);
	
	Если СтруктуруФайла <> Неопределено Тогда
		СтруктураЗапроса.Вставить("СтруктуруФайла", СтруктуруФайла);
	КонецЕсли;	

	Ответ = ОтправитьЗапросНаПолучениеИнформации(СтруктураЗапроса); 
	
	Возврат Ответ;	
	
	
КонецФункции	

#КонецОбласти


#Область Процедуры_И_Функции_Приложения_Сервер

//////Обновляем регистр сообщений///////
Процедура ЗаписатьИсториюСообщенийВайбер(МассивСообщений)Экспорт
	
	Для Каждого Стр из МассивСообщений Цикл
		ВыполнитьОбновлениеЗаписи(Стр); 
	КонецЦикла;	
	
КонецПроцедуры

/////Поиск и обновление записи регистра/////////////////////////
Процедура ВыполнитьОбновлениеЗаписи(Стр)
	
	ТокенСообщения = СтрЗаменить(Стр.ТокенСообщния, Символ(160), "");
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.Контакт КАК Контакт,
		|	ViberИсторииСообщений.Дата КАК Дата,
		|	ViberИсторииСообщений.Направление КАК Направление,
		|	ViberИсторииСообщений.ЧатID КАК ЧатID,
		|	ViberИсторииСообщений.ТокенСообщния КАК ТокенСообщния,
		|	ViberИсторииСообщений.ИсточникПривличения КАК ИсточникПривличения,
		|	ViberИсторииСообщений.Картинка КАК Картинка,
		|	ViberИсторииСообщений.Файл КАК Файл,
		|	ViberИсторииСообщений.Видео КАК Видео,
		|	ViberИсторииСообщений.Текст КАК Текст,
		|	ViberИсторииСообщений.ПутьКФайлу КАК ПутьКФайлу,
		|	ViberИсторииСообщений.Размер КАК Размер,
		|	ViberИсторииСообщений.Наименование КАК Наименование,
		|	ViberИсторииСообщений.ФайлВБазе КАК ФайлВБазе,
		|	ViberИсторииСообщений.Доставлено КАК Доставлено,
		|	ViberИсторииСообщений.Прочтено КАК Прочтено,
		|	ViberИсторииСообщений.Менеджер КАК Менеджер,
		|	ViberИсторииСообщений.Отправитель КАК Отправитель
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.ТокенСообщния ПОДОБНО &ТокенСообщния";
	
	Запрос.УстановитьПараметр("ТокенСообщния", ТокенСообщения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() > 0 Тогда 
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(Запись, Стр);
				Запись.Дата    = ПолучитьДатуИзСтроки(Стр.Дата);
				Запись.Контакт = ПолучитьКонтакт(Стр.Контрагент, Стр.НовоеСообщение, Стр.Подписан);
				Запись.ТокенСообщния   = ТокенСообщения;
			Если ЗначениеЗаполнено(Стр.Менеджер) Тогда
				Запись.Менеджер = Справочники.УчасникиЧата.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.Менеджер));
			КонецЕсли;
			
			Запись.Направление = Перечисления.Viber_Направление[Стр.Напрвление];
			
			УИДКлиента = Новый УникальныйИдентификатор(Стр.КлиентВайбер);
			СправочникКонтрагент = Справочники.КонтактыViber.ПолучитьСсылку(УИДКлиента);
			Если СсылкаСуществует(СправочникКонтрагент) Тогда
				Запись.КлиентВайбер = СправочникКонтрагент.Ссылка;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Менеджер) Тогда
				Запись.Отправитель = Справочники.УчасникиЧата.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.Менеджер));
			КонецЕсли;	
			    Запись.Записать();
			КонецЕсли;			
		КонецЦикла;
	Иначе
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.Дата     = ПолучитьДатуИзСтроки(Стр.Дата);
		Запись.Контакт  = ПолучитьКонтакт(Стр.Контрагент, Стр.НовоеСообщение, Стр.Подписан);
		Запись.ТокенСообщния   = ТокенСообщения;
		Если ЗначениеЗаполнено(Стр.Менеджер) Тогда
			Запись.Менеджер = Справочники.УчасникиЧата.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.Менеджер));
		КонецЕсли;
		
		Запись.Направление = Перечисления.Viber_Направление[Стр.Напрвление];
		
		Если ЗначениеЗаполнено(Стр.Менеджер) Тогда
			Запись.Отправитель = Справочники.УчасникиЧата.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.Менеджер));
		КонецЕсли;	
		
		УИДКлиента = Новый УникальныйИдентификатор(Стр.КлиентВайбер);
		СправочникКонтрагент = Справочники.КонтактыViber.ПолучитьСсылку(УИДКлиента);
		Если СсылкаСуществует(СправочникКонтрагент) Тогда
			Запись.КлиентВайбер = СправочникКонтрагент.Ссылка;
			Если НЕ ЗначениеЗаполнено(Запись.Контакт) Тогда
				ЗаписьС = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
				ЗаписьС.Контакт = СправочникКонтрагент.Ссылка;
				ЗаписьС.Прочитать();
				Если ЗаписьС.Выбран() Тогда
					ЗаписьС.Новое = Стр.НовоеСообщение;
					ЗаписьС.Записать();
				ИНаче
					ЗаписьС.Контакт = СправочникКонтрагент.Ссылка;
					ЗаписьС.Новое = Стр.НовоеСообщение;
					ЗаписьС.Записать();
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		Запись.Записать();
	КонецЕсли;	
		
						
			
	
	
	
КонецПроцедуры

/////запись шаблонов сообщений /////////////////////////////////
Процедура ОбновитьШаблоныВайбер(СписокШаблонов)Экспорт
	
	Для Каждого Ст из СписокШАблонов Цикл
		Спр = Справочники.ШаблоныСообщений.НайтиПоКоду(Ст.Код);
		Если Спр <> Справочники.ШаблоныСообщений.ПустаяСсылка() Тогда
			Если Спр.Текст <> Ст.Текст Тогда
				Нспр = Спр.ПолучитьОбъект();
				Нспр.Текст = Ст.Текст;
				Нспр.Записать();
			КонецЕсли;
		Иначе
			Нспр = Справочники.ШаблоныСообщений.СоздатьЭлемент();
			Нспр.Код          = Ст.Код;
			Нспр.Текст        = Ст.Текст;
			Нспр.Наименование = Ст.Наименование;
			Нспр.Записать();
		КонецЕсли;		
		
	КонецЦикла;	

КонецПроцедуры

//// записываем новые контакты /////////////////////////////////
Процедура ОбновитьСписокКонтактов(НовыеКонтакты)Экспорт
	
	Для Каждого Ст из НовыеКонтакты Цикл
		
		УИД = Новый УникальныйИдентификатор(Ст.ИДКонтакта);
		СправочникСсылка = Справочники.КонтактыViber.ПолучитьСсылку(УИД);
		Если НЕ СсылкаСуществует(СправочникСсылка) Тогда
        	Спр = Справочники.КонтактыViber.СоздатьЭлемент();
			
			Спр.ОбменДанными.Загрузка = Истина;
			Спр.УстановитьСсылкуНового(СправочникСсылка);
			
			Спр.Наименование = Ст.Наименование;
			Спр.Телефон      = Ст.Телефон;
			Спр.ДатаПодписки = Ст.Дата;
			Спр.Новый        = Истина;
			
			Спр.Записать();		
		
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

//// записываем новые контакты /////////////////////////////////
Процедура ОбновитьСписокНовых(НовыеКонтакты)Экспорт
	
	Для Каждого Ст из НовыеКонтакты Цикл
		
		УИД = Новый УникальныйИдентификатор(Ст.ИДКонтакта);
		СправочникСсылка = Справочники.КонтактыViber.ПолучитьСсылку(УИД);
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			Если ЗначениеЗАполнено(СправочникСсылка.Контрагент.ВерсияДанных) Тогда
				Если НЕ СправочникСсылка.Контрагент.ПодписанийВВайбере Тогда
					Спр = СправочникСсылка.Контрагент.ПолучитьОбъект();
					Спр.ПодписанийВВайбере = Истина;
					Если Ст.Статус = "Разрешон" Тогда
						Спр.СтатусДиалога = Истина;
					Иначе
						Спр.СтатусДиалога = Ложь;
					КонецЕсли;
					Спр.ОстатокСесия = Ст.Сесия;
					Спр.мЭтоОбмен = Истина;
					Спр.Записать();
				КонецЕсли;
			Иначе
				УИДКон = Новый УникальныйИдентификатор(Ст.ИДКонтрагента);
				СправочникСсылкаКон = Справочники.Контрагенты.ПолучитьСсылку(УИДКон);
				Если ЗначениеЗаполнено(СправочникСсылкаКон.Телефон) И (НЕ СправочникСсылкаКон.ПодписанийВВайбере ИЛИ СправочникСсылка.Контрагент <> СправочникСсылкаКон.Ссылка ) Тогда
					СпрК = СправочникСсылкаКон.ПолучитьОбъект();
					СпрК.ПодписанийВВайбере = Истина;
					Если Ст.Статус = "Разрешон" Тогда
						СпрК.СтатусДиалога = Истина;
					Иначе
						СпрК.СтатусДиалога = Ложь;
					КонецЕсли;
					СпрК.ОстатокСесия = Ст.Сесия;
					//Если СпрК.ПодписанийВВайбере = Спрк.Ссылка.ПодписанийВВайбере И Спрк.СтатусДиалога = СпрК.Ссылка.СтатусДиалога Тогда 
					СпрК.мЭтоОбмен = Истина;
					//КонецЕсли;

					СпрК.Записать();
					
					Спр = СправочникСсылка.ПолучитьОбъект();
					Спр.Контрагент = СпрК.Ссылка;
					Если Ст.Статус = "Разрешон" Тогда
						Спр.СтатусДиалога = Истина;
					Иначе
						Спр.СтатусДиалога = Ложь;
					КонецЕсли;
					
					Спр.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			
			
		Иначе
			Спр = Справочники.КонтактыViber.СоздатьЭлемент();
			
			Спр.ОбменДанными.Загрузка = Истина;
			Спр.УстановитьСсылкуНового(СправочникСсылка);
			
			Спр.Наименование = Ст.Наименование;
			Спр.Телефон      = Ст.Телефон;
			Спр.ДатаПодписки = Ст.Дата;
			Если Ст.Статус = "Разрешон" Тогда
				Спр.СтатусДиалога = Истина;
			Иначе
				Спр.СтатусДиалога = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ст.ИДКонтрагента) Тогда
				УИДКон = Новый УникальныйИдентификатор(Ст.ИДКонтрагента);
				СправочникСсылкаКон = Справочники.Контрагенты.ПолучитьСсылку(УИДКон);
				Если СсылкаСуществует(СправочникСсылкаКон) Тогда
					Спр.Контрагент = СправочникСсылкаКон; 
				КонецЕсли;
			КонецЕсли;	
			
			Попытка
				Спр.Записать();
				
				
				Если ЗначениеЗаполнено(Спр.Контрагент) Тогда
					СпрК = Спр.Контрагент.ПолучитьОбъект();				
					СпрК.ПодписанийВВайбере = Истина;
					Если Ст.Статус = "Разрешон" Тогда
						СпрК.СтатусДиалога = Истина;
					Иначе
						СпрК.СтатусДиалога = Ложь;
					КонецЕсли;   				
					СпрК.ОстатокСесия = Ст.Сесия;
					//Если СпрК.ПодписанийВВайбере = Спрк.Ссылка.ПодписанийВВайбере И Спрк.СтатусДиалога = СпрК.Ссылка.СтатусДиалога Тогда 
					СпрК.мЭтоОбмен = Истина;
					//КонецЕсли;
					
					СпрК.Записать();
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		УИДКон = Новый УникальныйИдентификатор(Ст.ИДКонтрагента);
		СправочникСсылкаКон = Справочники.Контрагенты.ПолучитьСсылку(УИДКон);
		Если  ЗначениеЗаполнено(СправочникСсылкаКон.Телефон) Тогда
			Если Ст.Статус = "Разрешон" Тогда
				СтатусДиалога = Истина;
			Иначе
				СтатусДиалога = Ложь;
			КонецЕсли;
			
			ОстатокСесия = Ст.Сесия;
			Если НЕ ЗначениеЗаполнено(ОстатокСесия) Тогда
				ОстатокСесия = 0;
			КонецЕсли;	
			
			Если СправочникСсылкаКон.СтатусДиалога <> СтатусДиалога ИЛИ СправочникСсылкаКон.ОстатокСесия <> Число(ОстатокСесия) Тогда 
				СпрК = СправочникСсылкаКон.ПолучитьОбъект();
				Если Ст.Статус = "Разрешон" Тогда
					СпрК.СтатусДиалога = Истина;
				Иначе
					СпрК.СтатусДиалога = Ложь;
				КонецЕсли;   				
				СпрК.ОстатокСесия = Ст.Сесия;	
				Попытка 
					СпрК.мЭтоОбмен = Истина;
					СпрК.Записать();
				Исключение
					
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла
	
КонецПроцедуры


/////// отправить контак вайбер //////////////////////////////
Процедура ОтправитьКонтрагентаНаСервере(Контакт, Контрагент)Экспорт
	
	
	Данные = Новый Структура("Контрагенты", Истина);
	Данные.Вставить("ОтборКонтрагент", Контрагент);
	ДанныеКонтрагента = Обмен_АнализДанных.ОтправитьИзменения(Данные);
	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("method", "svias");
	СтруктураЗапроса.Вставить("Контрагент", Строка(Контрагент.УникальныйИдентификатор()));
	СтруктураЗапроса.Вставить("Наименование", Строка(Контрагент.Наименование));
	СтруктураЗапроса.Вставить("Телефон", Строка(Контрагент.Телефон));
	СтруктураЗапроса.Вставить("Контакт", Строка(Контакт.УникальныйИдентификатор()));
	СтруктураЗапроса.Вставить("ДанныеКонтрагента", XMLСтрока(Новый ХранилищеЗначения(ДанныеКонтрагента)));
	СтруктураЗапроса.Вставить("Пароль", Константы.ПарольВхода.Получить());



	Ответ = ОтправитьЗапросНаПолучениеИнформации(СтруктураЗапроса);
	
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		Если Ответ.Result = "Ok" Тогда 
	    	ПерезаписываемСообщенияВайбер(Ответ.СписокСообщений);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

////// проверяем на уид /////////////////////////////////////
Функция СсылкаСуществует(ПроверяемаяСсылка) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", ИмяТаблицыПоСсылке(ПроверяемаяСсылка));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ПроверяемаяСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции


#КонецОбласти

////// форматируем дату /////////////////////
Функция ПолучитьДатуИзСтроки(Дата)
	
	ДатаСтрокой = Лев(Дата, 2) + "." + Сред(Дата, 3,2) + "." + Сред(Дата, 5, 4) + " " + Сред(Дата, 9, 2) + ":" + Сред(Дата, 11, 2) + ":" + Сред(Дата, 13, 2);
	
	Возврат Дата(ДатаСтрокой);	
	
КонецФункции

////// форматируем контакта /////////////////
Функция ПолучитьКонтакт(СтруктураКонтакт, НовоеСообщение, Подписан)
	
	Если НЕ ЗначениеЗаполнено(СтруктураКонтакт) Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	
	//// поиск по ИД /////////////////////
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураКонтакт.ИД));
	Если СсылкаСуществует(Контрагент) Тогда
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Если НовоеСообщение Тогда
				Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
				Запись.Контакт = Контрагент;
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Запись.Новое = Истина;
					Запись.Записать();
				Иначе
					Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
					Запись.Контакт = Контрагент;
					Запись.Новое = Истина;
					Запись.Записать();
				КонецЕсли;			
			КонецЕсли;
			
			Если НЕ Контрагент.ПодписанийВВайбере Тогда
				Спр = Контрагент.ПолучитьОбъект();
				Спр.ПодписанийВВайбере = Истина;
				Спр.мЭтоОбмен = Истина;
				Спр.Записать();
			КонецЕсли;	
			
			Возврат Контрагент;
		КонецЕсли;
	КонецЕсли;	
		
	 
	
	////// поиск по телефону ////////////
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Телефон В(&Телефон)";
	
	Запрос.УстановитьПараметр("Телефон", СтруктураКонтакт.Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Спр = ВыборкаДетальныеЗаписи[0].Ссылка.ПолучитьОбъект();
		Спр.НовоеСообщение = НовоеСообщение;
		Спр.ПодписанийВВайбере = Подписан;
		Спр.мЭтоОбмен = Истина;
		Спр.Записать();
		
		Возврат ВыборкаДетальныеЗаписи[0].Ссылка;
	Иначе
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли; 
	
	
КонецФункции


#Область Фоновое_Задание

///// проверяем на действующие фоновое задание ///////////////////////////
Функция ОбменДаннымиЗакончен(Идентификатор, ТекстОшибки) Экспорт
	
	ТекстОшибки = "";
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если Задание = Неопределено Тогда
		Возврат Истина; // вероятно уже вытеснено из памяти
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		ТекстОшибки = Задание.ИнформацияОбОшибке.Описание;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

///// идентификатор фонового задания /////////////////////////////////////
Функция ВыполнитьОбменДаннымиВФоне() Экспорт
	
	Задание = ФоновыеЗадания.Выполнить("ViberОбновлениеСервер.ВыполнитьЗагрузкуНовыхСообщений",,, "Синхронизация");
	Возврат Задание.УникальныйИдентификатор;
	   ФоновыеЗадания.ПолучитьФоновыеЗадания()
КонецФункции

///// получаем список сообщений через сервер ////////////////////////////
Функция ВыполнитьЗагрузкуНовыхСообщений()Экспорт
	ДатаОбмена = ТекущаяДата() - 3 * 24 * 3600;
	
	Ответ = ViberОбновлениеСервер.ОбновитьСписокИсторииСообщений();
	Если Ответ <> Неопределено Тогда
		Если Ответ.Свойство("МассивСообщений") Тогда
			ViberОбновлениеСервер.ЗаписатьИсториюСообщенийВайбер(Ответ.МассивСообщений);		
		КонецЕсли;
		
		Если Ответ.Свойство("Шаблоны") Тогда
			ViberОбновлениеСервер.ОбновитьШаблоныВайбер(Ответ.Шаблоны);				
		КонецЕсли;
		
		Если Ответ.Свойство("НовыеКонтакты") Тогда
			ViberОбновлениеСервер.ОбновитьСписокКонтактов(Ответ.НовыеКонтакты);				
		КонецЕсли;
		
		Если Ответ.Свойство("МассивКонтактыВайбер") Тогда
			ViberОбновлениеСервер.ОбновитьСписокНовых(Ответ.МассивКонтактыВайбер);				
		КонецЕсли;
 
		
		//Константы.ДатаОбновлениеСообщений.Установить(ТекущаяДата());
		  Константы.ДатаПоследнегоОбновленияВайбер.Установить(ДатаОбмена);
	КонецЕсли;
	
КонецФункции	

///// отправляем индиктор проитано в фоне ///////////////////////////////
Функция ВыполнитьОтправкуПрочитаноВФоне(Параметры)Экспорт
	
	Задание = ФоновыеЗадания.Выполнить("ViberОбновлениеСервер.ОтправитьСообщениеПрочитано", Параметры,, "Синхронизация");
	Возврат Задание.УникальныйИдентификатор;
	
КонецФункции

///// отправить сообщение прочитано ////////////////////////////////////
Процедура ОтправитьСообщениеПрочитано(Параметры)Экспорт
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("method", "smsoff");
	СтруктураЗапроса.Вставить("Контрагент", Строка(Параметры.УникальныйИдентификатор()));
	Если ТипЗнч(Параметры) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураЗапроса.Вставить("КонтрагентСсылка", Истина);
	Иначе	
		СтруктураЗапроса.Вставить("КонтрагентСсылка", Ложь);
	КонецЕсли;	
	
	Ответ = ОтправитьЗапросНаПолучениеИнформации(СтруктураЗапроса); 
	
		
КонецПроцедуры

////// отправляем связь с контрагентом ///////////////////////////////
Функция ОтправитьСыязьНаСервере(Контрагент, Контакт)Экспорт
	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("method", "contakt");
	СтруктураЗапроса.Вставить("Контрагент", Строка(Контрагент.УникальныйИдентификатор()));
	СтруктураЗапроса.Вставить("Контакт", Строка(Контакт.УникальныйИдентификатор()));
	
	Ответ = ОтправитьЗапросНаПолучениеИнформации(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции	

////// перезаписіваем сообщение с контрагентом //////////////////////
Процедура ПерезаписываемСообщенияВайбер(Список)Экспорт
	
	Для Каждого Сообщения Из Список Цикл
		
		УИДКонтрагента = Новый УникальныйИдентификатор(Сообщения.Контрагент);
		СправочникКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(УИДКонтрагента);
		Если СсылкаСуществует(СправочникКонтрагент) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ViberИсторииСообщений.Контакт КАК Контакт,
				|	ViberИсторииСообщений.Дата КАК Дата,
				|	ViberИсторииСообщений.Направление КАК Направление,
				|	ViberИсторииСообщений.ЧатID КАК ЧатID,
				|	ViberИсторииСообщений.ТокенСообщния КАК ТокенСообщния,
				|	ViberИсторииСообщений.ИсточникПривличения КАК ИсточникПривличения,
				|	ViberИсторииСообщений.Картинка КАК Картинка,
				|	ViberИсторииСообщений.Файл КАК Файл,
				|	ViberИсторииСообщений.Видео КАК Видео,
				|	ViberИсторииСообщений.Текст КАК Текст,
				|	ViberИсторииСообщений.ПутьКФайлу КАК ПутьКФайлу,
				|	ViberИсторииСообщений.Размер КАК Размер,
				|	ViberИсторииСообщений.Наименование КАК Наименование,
				|	ViberИсторииСообщений.ФайлВБазе КАК ФайлВБазе,
				|	ViberИсторииСообщений.Доставлено КАК Доставлено,
				|	ViberИсторииСообщений.Прочтено КАК Прочтено,
				|	ViberИсторииСообщений.Менеджер КАК Менеджер,
				|	ViberИсторииСообщений.Отправитель КАК Отправитель
				|ИЗ
				|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
				|ГДЕ
				|	ViberИсторииСообщений.ТокенСообщния = &ТокенСообщния";
			
			Запрос.УстановитьПараметр("ТокенСообщния", Сообщения.Токен);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи); 
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Запись.Контакт = СправочникКонтрагент.Ссылка;
					Запись.Записать();
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;			
	КонецЦикла	
	
	
КонецПроцедуры	


#КонецОбласти

#Область Процедуры_Поля_НТМЛ

Функция ПолучитьПолеПереписки(Контакт, ПапкаФайлов, Картинки = Неопределено)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.Контакт КАК Контакт,
		|	ViberИсторииСообщений.Дата КАК Дата,
		|	ViberИсторииСообщений.Направление КАК Направление,
		|	ViberИсторииСообщений.ЧатID КАК ЧатID,
		|	ViberИсторииСообщений.ТокенСообщния КАК ТокенСообщния,
		|	ViberИсторииСообщений.ИсточникПривличения КАК ИсточникПривличения,
		|	ViberИсторииСообщений.Картинка КАК Картинка,
		|	ViberИсторииСообщений.Файл КАК Файл,
		|	ViberИсторииСообщений.Видео КАК Видео,
		|	ViberИсторииСообщений.Текст КАК Текст,
		|	ViberИсторииСообщений.ПутьКФайлу КАК ПутьКФайлу,
		|	ViberИсторииСообщений.Размер КАК Размер,
		|	ViberИсторииСообщений.Наименование КАК Наименование,
		|	ViberИсторииСообщений.ФайлВБазе КАК ФайлВБазе,
		|	ViberИсторииСообщений.Доставлено КАК Доставлено,
		|	ViberИсторииСообщений.Прочтено КАК Прочтено,
		|	ViberИсторииСообщений.Менеджер КАК Менеджер,
		|	ViberИсторииСообщений.Отправитель КАК Отправитель
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.Контакт = &Контакт";
	
	Запрос.УстановитьПараметр("Контакт", Контакт);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	HTML_Схема = ПолучитьСхемуHTML();
	
	Для Каждого Сообщения из РезультатЗапроса Цикл
		Если Сообщения.Направление = Перечисления.Viber_Направление.Входящее Тогда
			Если Сообщения.Доставлено Тогда 
				Класс = "newin";
			Иначе
				Класс = "in";
			КонецЕсли;	
		Иначе
			Класс = "out";
		КонецЕсли;
		
		Если НЕ Сообщения.Картинка И НЕ Сообщения.Файл И НЕ Сообщения.Видео Тогда
			Текст = Сообщения.Текст;
		Иначе
			Текст = Сообщения.Наименование;
		КонецЕсли;
		
		Время = ?(Сообщения.Дата < НачалоДня(ТекущаяДата()), Формат(Сообщения.Дата, "ДФ='дд.ММ.гг ЧЧ:мм'"), Формат(Сообщения.Дата, "ДФ=ЧЧ:мм"));
		
		Если НЕ Сообщения.Картинка И НЕ Сообщения.Файл И НЕ Сообщения.Видео Тогда   
			
			HTML_Схема = HTML_Схема + Символы.ПС + "		<div class=""" + Класс + """>" + Текст + " <font color=""#666666""><sub>" + Время + "</sub></font></div><br clear=""all"">";
			
		ИначеЕсли Сообщения.Картинка Тогда
			
			HTML_Схема = HTML_Схема + Символы.ПС + "		<div class=""" + Класс + """ style=""text-align: right;""><img height=""200"" src=""" + Сообщения.ПутьКФайлу + """ ><br><font color=""#666666""><sub>" + Время + "</sub></font></div><br clear=""all"">";

		Иначе
			
			HTML_Схема = HTML_Схема + Символы.ПС + "		<div class=""" + Класс + """> <a href=""" + Текст + """><b><i>" + Сообщения.ПутьКФайлу + "</i></b></a> <font color=""#666666""><sub>" + Время + "</sub></font></div><br clear=""all"">";
			
    	КонецЕсли;	
		
	КонецЦикла;	
	
	HTML_Схема = HTML_Схема + Символы.ПС +
	
	
	"	</body>
	|</html>";

	Возврат Новый Структура("Переписка", HTML_Схема);
	
	
КонецФункции

Функция ПолучитьПолеПерепискиКонтакт(Контакт, ПапкаФайлов, Картинки = Неопределено)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.Контакт КАК Контакт,
		|	ViberИсторииСообщений.Дата КАК Дата,
		|	ViberИсторииСообщений.Направление КАК Направление,
		|	ViberИсторииСообщений.ЧатID КАК ЧатID,
		|	ViberИсторииСообщений.ТокенСообщния КАК ТокенСообщния,
		|	ViberИсторииСообщений.ИсточникПривличения КАК ИсточникПривличения,
		|	ViberИсторииСообщений.Картинка КАК Картинка,
		|	ViberИсторииСообщений.Файл КАК Файл,
		|	ViberИсторииСообщений.Видео КАК Видео,
		|	ViberИсторииСообщений.Текст КАК Текст,
		|	ViberИсторииСообщений.ПутьКФайлу КАК ПутьКФайлу,
		|	ViberИсторииСообщений.Размер КАК Размер,
		|	ViberИсторииСообщений.Наименование КАК Наименование,
		|	ViberИсторииСообщений.ФайлВБазе КАК ФайлВБазе,
		|	ViberИсторииСообщений.Доставлено КАК Доставлено,
		|	ViberИсторииСообщений.Прочтено КАК Прочтено,
		|	ViberИсторииСообщений.Менеджер КАК Менеджер,
		|	ViberИсторииСообщений.Отправитель КАК Отправитель
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.КлиентВайбер = &КлиентВайбер";
	
	Запрос.УстановитьПараметр("КлиентВайбер", Контакт);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	HTML_Схема = ПолучитьСхемуHTML();
	
	Для Каждого Сообщения из РезультатЗапроса Цикл
		Если Сообщения.Направление = Перечисления.Viber_Направление.Входящее Тогда
			Если Сообщения.Доставлено Тогда 
				Класс = "newin";
			Иначе
				Класс = "in";
			КонецЕсли;	
		Иначе
			Класс = "out";
		КонецЕсли;
		
		Если НЕ Сообщения.Картинка И НЕ Сообщения.Файл И НЕ Сообщения.Видео Тогда
			Текст = Сообщения.Текст;
		Иначе
			Текст = Сообщения.Наименование;
		КонецЕсли;
		
		Время = ?(Сообщения.Дата < НачалоДня(ТекущаяДата()), Формат(Сообщения.Дата, "ДФ='дд.ММ.гг ЧЧ:мм'"), Формат(Сообщения.Дата, "ДФ=ЧЧ:мм"));
		
		Если НЕ Сообщения.Картинка И НЕ Сообщения.Файл И НЕ Сообщения.Видео Тогда   
			
			HTML_Схема = HTML_Схема + Символы.ПС + "		<div class=""" + Класс + """>" + Текст + " <font color=""#666666""><sub>" + Время + "</sub></font></div><br clear=""all"">";
			
		ИначеЕсли Сообщения.Картинка Тогда
			
			HTML_Схема = HTML_Схема + Символы.ПС + "		<div class=""" + Класс + """ style=""text-align: right;""><img height=""200"" src=""" + Сообщения.ПутьКФайлу + """ ><br><font color=""#666666""><sub>" + Время + "</sub></font></div><br clear=""all"">";

		Иначе
			
			HTML_Схема = HTML_Схема + Символы.ПС + "		<div class=""" + Класс + """> <a href=""" + Текст + """><b><i>" + Сообщения.ПутьКФайлу + "</i></b></a> <font color=""#666666""><sub>" + Время + "</sub></font></div><br clear=""all"">";
			
    	КонецЕсли;	
		
	КонецЦикла;	
	
	HTML_Схема = HTML_Схема + Символы.ПС +
	
	
	"	</body>
	|</html>";

	Возврат Новый Структура("Переписка", HTML_Схема);
	
	
КонецФункции

Функция ПолучитьСхемуHTML()
	
	Поле = 
	"<!DOCTYPE html>
	|<html>
	|<head>
	|	<script>
	|		function scrollToEnd(){window.scrollTo(0, document.body.scrollHeight);}
	|	</script>
	|	<style>
	| 		div {
	|  			max-width: 600px;
	|			border-radius: 10px;
	|			margin: 4px;
	|			padding: 4px;
	|		}
	| 		div.in {
	|  			float: left;
	|			border: 4px solid #ffffff;
	|			background-color: #ffffff;
	|		}
	| 		div.out {
	|  			float: right;
	|			border: 4px solid #a9dbee;
	|			background-color: #a9dbee;
	|		}
	| 		div.newin {
	|  			float: Лево;
	|			border: 4px solid #999999;
	|			background-color: #999999;
	|		}
	|	</style>
	|</head>
	|	<body bgcolor=""#dde1e2"" style=""font-family:Tahoma, Geneva, sans-serif"" onload = ""scrollToEnd()"">";

	
	Возврат Поле;
	
	
КонецФункции	





#КонецОбласти
